In [8]:
import pandas as pd
from numpy import NaN, NAN, nan

#missing values denoted by NaN etc in the data comes from numpy liberary

In [6]:
#these values are not true or false but just missing values

NaN == True

False

In [7]:
NaN == False

False

In [9]:
pd.isnull(NaN)

True

In [10]:
visited = pd.read_csv('../Naveen/Documents/data/2016-pydata-carolinas-pandas-master/data/survey_visited.csv')

In [11]:
visited

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3         NaN
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

In [14]:
#removing the default missing values

visited = pd.read_csv('../Naveen/Documents/data/2016-pydata-carolinas-pandas-master/data/survey_visited.csv', 
                      keep_default_na=False)

In [15]:
visited

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

In [28]:
#replacing NaN values
visited = pd.read_csv('../Naveen/Documents/data/2016-pydata-carolinas-pandas-master/data/survey_visited.csv', 
                      keep_default_na=False, 
                      na_values=[''])

In [29]:
visited

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3         NaN
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

In [ ]:
pd.isnull(visited.dated)

In [31]:
visited.ix[pd.isnull(visited.dated), ]

   ident  site dated
5    752  DR-3   NaN